{
  "mnemonic": "CPUID",
  "summary": "CPU Identification",
  "index": 90,
  "instructions": [
    {
      "opcode": "0F A2",
      "instr": "CPUID",
      "op_en": "ZO",
      "x64": "Valid",
      "x32": "Valid",
      "desc": "Returns processor identification and feature information to the EAX, EBX, ECX, and EDX registers, as determined by input entered in EAX (in some cases, ECX as well)."
    }
  ],
  "op_en": [
    {
      "op_en": "ZO",
      "tuple_type": "NA",
      "operand_1": "NA",
      "operand_2": "NA",
      "operand_3": "NA"
    }
  ],
  "page_desc": [
    "The ID flag (bit 21) in the EFLAGS register indicates support for the CPUID instruction. If a software procedure can set and clear this flag, the processor executing the procedure supports the CPUID instruction. This instruction operates the same in non-64-bit modes and 64-bit mode.",
    "CPUID returns processor identification and feature information in the EAX, EBX, ECX, and EDX registers.1The instruction’s output is dependent on the contents of the EAX register upon execution (in some cases, ECX as well). For example, the following pseudocode loads EAX with 00H and causes CPUID to return a Maximum Return Value and the Vendor Identification String in the appropriate registers:",
    "MOV EAX, 00H",
    "CPUID",
    "Table 3-8shows information returned, depending on the initial value loaded into the EAX register.",
    "Two types of information are returned: basic and extended function information. If a value entered for CPUID.EAX is higher than the maximum input value for basic or extended function for that processor then the data for the highest basic information leaf is returned. For example, using some Intel processors, the following is true:",
    "CPUID.EAX = 05H (* Returns MONITOR/MWAIT leaf. *)",
    "CPUID.EAX = 0AH (* Returns Architectural Performance Monitoring leaf. *) CPUID.EAX = 0BH (* Returns Extended Topology Enumeration leaf. *)2CPUID.EAX =1FH (* Returns V2 Extended Topology Enumeration leaf. *)2",
    "CPUID.EAX = 80000008H (* Returns linear/physical address size data. *)",
    "CPUID.EAX = 8000000AH (* INVALID: Returns same information as CPUID.EAX = 0BH. *)",
    "If a value entered for CPUID.EAX is less than or equal to the maximum input value and the leaf is not supported on that processor then 0 is returned in all the registers.",
    "When CPUID returns the highest basic leaf information as a result of an invalid input EAX value, any dependence on input ECX value in the basic leaf is honored.",
    "CPUID can be executed at any privilege level to serialize instruction execution. Serializing instruction execution guarantees that any modifications to flags, registers, and memory for previous instructions are completed before the next instruction is fetched and executed.",
    "See also:",
    "“Serializing Instructions” in Chapter 8, “Multiple-Processor Management,” in theIntel® 64 and IA-32 Architectures Software Developer’s Manual, Volume 3A.",
    "“Caching Translation Information” in Chapter 4, “Paging,” in theIntel® 64 and IA-32 Architectures Software Developer’s Manual, Volume 3A."
  ]
}
